
*** 2016-09-15

 Here are a couple of examples of getting org-mode's code to run.  They are pretty fancy. :)

 #+BEGIN_SRC js
   var foo=1;
   var bar=2;
   var l=[1,2,3];
   l.forEach(function(v) {
       var n=v+bar;
       console.log('Value:'+n);
   });
 #+END_SRC

 #+RESULTS:
 : Value:3
 : Value:4
 : Value:5
 : undefined


 This is one that I really like, Nice way  to document some example queries within org-mode.

 #+name: test
 #+header: :engine postgresql
 #+header: :database quinn
 #+BEGIN_SRC sql
 select name from california_counties limit 5;
 #+END_SRC

 #+RESULTS: test
 | name      |
 |-----------|
 | Siskiyou  |
 | Del Norte |
 | Modoc     |
 | Trinity   |
 | Shasta    |


 \begin{align*}
 3 * 2 + &= 6 +1 \\
 & =7
 \end{align*}


**** Sharing code between cmd-line and web-components

 Rather than making three repos for a single project just to not include cmd-line code in a web-component, and visa-versa, it'd be nice to just have one.  I have an idea that we could make a single version, but then have a few branches, that just have a .gitattributes file in there that eliminates certain files, and then switch branches before makeing releases.

 I'll test this using the polymer-cli.

 #+BEGIN_SRC bash
 mkdir ~/scriptAPI-vision && cd ~/scriptAPI-vision
 polymer init
 #+END_SRC

 I'm looking at a few different generators, to compare.  If we try the grunt generator for node, there are some pretty nice features including; =.jshintrc= for jshint checking, and =.travis.yml= for github testing.  tasks include *nodeunit* and *jshint*

 #+BEGIN_SRC bash :dir ~/scribeAPI-vision
 git checkout -b grunt
 git clone https://github.com/gruntjs/grunt-init-node ~/.grunt-init/node
 grunt-init node
 #+END_SRC

 #+BEGIN_SRC bash :dir ~/scribeAPI-vision :results type scalar
 tree -I node_modules
 #+END_SRC

 #+RESULTS:
 #+begin_example
 .
 ├── bower.json
 ├── demo
 │   └── index.html
 ├── Gruntfile.js
 ├── index.html
 ├── lib
 │   └── scribeAPI-tools.js
 ├── LICENSE-MIT
 ├── package.json
 ├── README.md
 ├── scribeAPI-fetch.html
 ├── scribeAPI-vision.html
 └── test
     ├── scribeAPI-tools_test.js
     └── scribeAPI-vision_test.html

 3 directories, 12 files
 #+end_example

*** 2016-09-23

 Continuing with [[*Sharing%20code%20between%20cmd-line%20and%20web-components][Sharing code between cmd-line and web-components]] I want to look instead at yeoman.   The advantages to yeoman are of coruse they are closer to the polymer-cli, though that doesn't affect our generator much.  I'll try the [[https://github.com/yeoman/generator-node][Yeoman Node Generator]], as a comparison.

 #+BEGIN_SRC bash :dir /sudo::
 npm install -g generator-node
 #+END_SRC

 #+BEGIN_SRC bash :dir ~/scribeAPI-vision :results type scalar
 mv bower_components .bower_components
 tree -I node_modules
 mv .bower_components bower_components
 #+END_SRC

 #+RESULTS:
 #+begin_example
 .
 ├── bower.json
 ├── coverage
 │   ├── coverage-final.json
 │   ├── lcov.info
 │   └── lcov-report
 │       ├── base.css
 │       ├── index.html
 │       ├── lib
 │       │   ├── index.html
 │       │   ├── index.js.html
 │       │   └── scribeAPI-tools.js.html
 │       ├── prettify.css
 │       ├── prettify.js
 │       ├── sort-arrow-sprite.png
 │       └── sorter.js
 ├── demo
 │   └── index.html
 ├── dist
 │   ├── index.js
 │   └── scribeAPI-tools.js
 ├── Gruntfile.js
 ├── gulpfile.js
 ├── index.html
 ├── lib
 │   └── index.js
 ├── LICENSE
 ├── package.json
 ├── README.md
 ├── scribeAPI-fetch.html
 ├── scribeAPI-vision.html
 └── test
     ├── index.js
     └── scribeAPI-vision_test.html

 7 directories, 26 files
 #+end_example

 The yeoman file does some stuff I really like.  That includes the =.editorconfig= file, and maybe the =.babelrc=

**** EZID Authentication

 EZID allows basic authentication.  You can easily use this by adding the ezid
 api to your .netrc file, example below.

 #+BEGIN_EXAMPLE
 machine ezid.cdlib.org
   login ucd-qjhart
   password secret-password
 #+END_EXAMPLE

 This makes it easy to use the API without any additional values on the command-line.

 #+BEGIN_SRC bash :results scalar
 http GET https://ezid.cdlib.org/id/ark:/85140/d4zx08
 #+END_SRC

 #+RESULTS:
 : success: ark:/85140/d4zx08
 : _updated: 1480544681
 : _target: https://labelthis.lib.ucdavis.edu/view/2603
 : _profile: erc
 : _export: yes
 : _owner: ucd-library
 : _ownergroup: ucd-library
 : _created: 1461090788
 : _status: unavailable

 You can also use httpie's `--session` variable. This can allow you to save a
 session specifically for adding data for example.  In this case, you don't save
 your credentials in your .netrc file.  Instead, you pass the credentials on a `/login` to a
 session.  The session will store your Cookie, and you can then use that session
 for edits. This allows multiple username combinations as well. For example:

 #+BEGIN_SRC bash :results scalar
 http --session=qjhart -a ucd-qjhart:${PASSWORD} https://ezid.cdlib.org/login
 http --session=qjhart PUT https://ezid.cdlib.org/id/ark:/99999/fk4qjhart2
 http GET https://ezid.cdlib.org/id/ark:/99999/fk4qjhart2
 #+END_SRC

 #+RESULTS:
 : error: method not allowed

 From here, you can then make your updates to the data.

 #+BEGIN_SRC bash :results scalar
 http --session=qjhart POST https://ezid.cdlib.org/id/ark:/99999/fk4zp5806q Content-Type:text/plain <<<'_target:https://library.ucdavis.edu'
 http GET https://ezid.cdlib.org/id/ark:/99999/fk4zp5806q
 #+END_SRC

 #+RESULTS:
 : success: ark:/99999/fk4zp5806qsuccess: ark:/99999/fk4zp5806q
 : _updated: 1524003099
 : _target: https://library.ucdavis.edu
 : _profile: erc
 : _export: yes
 : _owner: ucd-qjhart
 : _ownergroup: ucd-library
 : _created: 1524001735
 : _status: public

 #+BEGIN_SRC bash :results scalar
 http GET https://ezid.cdlib.org/id/ark:/99999/fk4qjhart2
 http --session=qjhart POST https://ezid.cdlib.org/shoulder/ark:/99999/fk4
 #+END_SRC

 #+RESULTS:
 : success: ark:/99999/fk4q53tc7s

